const mass = ["акушеры", "аллергологи", "ангиохирурги", "андрологи", "анестезиологи-реаниматологи", "аритмологи", "венерологи"
    , "вертебрологи", "врачи-косметологи", "врачи лечебной физкультуры", "врачи общей практики", "врачи скорой помощи", "врачи УЗИ",
    "врачи эфферентной терапии", "гастроэнтерологи", "гематологи", "генетики", "гепатологи", "гинекологи", "гинекологи-эндокринологи",
    "гирудотерапевты", "гнойные хирурги", "гомеопаты", "дерматологи", "дефектологи", "диетологи", "иммунологи", "инфекционисты",
    "кардиологи", "кардиохирурги", "клинические фармакологи", "лазерные хирурги", "логопеды", "ЛОРы", "малоинвазивные хирурги", "маммологи"
    , "мануальные терапевты", "массажисты", "микологи", "наркологи", "неврологи", "нейрохирурги", "неонатологи", "нефрологи", "ожоговые хирурги"
    , "онкологи", "онкологи-гинекологи", "онкологи-урологи", "ортопеды", "остеопаты", "офтальмологи", "офтальмологи-хирурги"
    , "паразитологи", "пародонтологи", "педиатры", "пластические хирурги", "подологи(подиатры)", "проктологи", "профпатологи"
    , "психиатры", "психологи", "психотерапевты", "пульмонологи", "радиологи", "реалибитологи", "ревматологи", "рентгенологи"
    , "репродуктологи", "рефлексотерапевты", "сексологи", "сомнологи", "спортивные врачи", "судебно-медицинские эксперты", "сурдологи"
    , "терапевты", "торакальные онкологи", "торакальные хирурги", "травмотологи", "трансфузиологи", "трихологи", "урологи"
    , "физиотерапевты", "флеболог", "фониатры", "фтизиатры", "функциональные диагносты", "химиотерапевты", "хирурги", "хирурги-эндокринологи"
    , "челюстно-лицевые хирурги", "эмбриологи", "эндокринологи", "эндоскописты", "эпедимиолог", "эпилептологи"];

function f(string) {
    return {
        [string]: {
            specializationName: string,
            haveChild: false
        }
    }
}

function f1() {
    let mass2 = mass.map(a => f(a));
    return mass2
}

console.log(JSON.stringify(f1()));